// ==========================================
// ### Page 36: chapter 07 分岐 (switchの練習)
// ==========================================

let i = 1;
console.log(i);

a = Math.floor(Math.random() * 4) + 3;

console.log(a);

let kushami;

kushami = Math.floor(Math.random() * 3) + 1;

if (kushami === 1) {
  console.log("kushamiが" + kushami + "なので、くしゃみです");
}

// ---------------------------------

switch (kushami) {
  case 1:
    console.log("くしゃみです");
    break;
  // それ以外の場合
  default:
    console.log("くしゃみではありません");
    break;
}

// ==========================================
// ### Page 37: practice 03 分岐 (分岐課題 ①)
// ① サイコロの目が1のときは大吉。2のときは中吉...
// ==========================================

// ---------------------------------

// さいころをふる

// 1のときは大吉、２のときは中吉、３のときは小吉、そのほかは凶
let dice = Math.floor(Math.random() * 6) + 1;
console.log("さいころの目は" + dice + "です");
switch (dice) {
  case 1:
    console.log("大吉です");
    break;
  case 2:
    console.log("中吉です");
    break;
  case 3:
    console.log("小吉です");
    break;
  default:
    console.log("凶です");
    break;
}

// ==========================================
// ### Page 37: practice 03 分岐 (分岐課題 ②)
// ② 月をランダムで選択。その月の祝日を表示する
// ==========================================

// ---------------------------------

// 1〜12月をランダムに生成
let month = Math.floor(Math.random() * 12) + 1;
console.log(month + "月が選ばれました");

switch (month) {
  case 1:
    console.log("元日、成人の日");
    break;
  case 2:
    console.log("建国記念の日");
    break;
  case 3:
    console.log("春分の日");
    break;
  case 4:
    console.log("昭和の日");
    break;
  case 5:
    console.log("憲法記念日、みどりの日、こどもの日");
    break;
  case 7:
    console.log("海の日");
    break;
  case 9:
    console.log("敬老の日、秋分の日");
    break;
  case 10:
    console.log("体育の日");
    break;
  case 11:
    console.log("文化の日、勤労感謝の日");
    break;
  case 12:
    console.log("天皇誕生日");
    break;
  default:
    console.log("祝日ではありません");
    break;
}

// ==========================================
// ### Page 45: practice 03 分岐 (ループ課題 ①)
// ①★を以下のように出力しよう。(10個ずつ改行)
// ==========================================

// ---------------------------------

// while
// 三行　星10個を作成
let star = "";
//
while (i < 31) {
  star = star + "★";
  i = i + 1;

  //10の倍数のとき
  if (i % 10 === 0) {
    console.log(star);
    star = "";
  }
}

// ==========================================
// ### Page 45: practice 03 分岐 (ループ課題 ②)
// ②★を以下のように出力しよう。(1行ごとに増やす)
// ==========================================

// ---------------------------------
// ★が１行が１個順番に、４行まで表示される（なお一つずつ★が追加される）
let line = 1;
star = "";

//5行未満のまで
while (line < 5) {
  star = star + "★";

  //表示する
  console.log(star);

  line = line + 1;
}

// ==========================================
// ### Page 45: practice 03 分岐 (ループ課題 ③)
// ③ 田中さんと山田さんがそれぞれ3分の1でくしゃみをする...
// ==========================================

// ---------------------------------

// 田中さんと山田さんが３分の１の確率でくしゃみをする
let tanakaKushami = 0;
let yamadaKushami = 0;
let count = 0;

//どちらかがくしゃみをするまで繰り返す
while (true) {
  //くしゃみをランダムに決定
  tanakaKushami = Math.floor(Math.random() * 3) + 1;
  yamadaKushami = Math.floor(Math.random() * 3) + 1;

  console.log("田中さんのくしゃみ：" + tanakaKushami);
  console.log("山田さんのくしゃみ：" + yamadaKushami);

  console.log("どちらかがくしゃみをするまで繰り返します");
  if (tanakaKushami == 1 && yamadaKushami == 1) {
    break;
  }
  count++;
}

console.log("くしゃみが出ました！");
console.log("繰り返した回数は" + count + "回です");

// ==========================================
// ### Page 46: practice 03 分岐 (ループ課題 ④)
// ④ 毎日キャベツを切り続ける...腱鞘炎になる確率...
// ==========================================

// ----------------------------------

//1日につき、3分の1で水が飲める。
//夜に抽選を行う。水を飲まない場合、普通だったら10分の1で腱鞘炎になる。
//朝の抽選で3分の1で水を飲んでると、30分の1で検証員になる。

console.log("ーーーーーーーーーーーー腱鞘炎テスト開始ーーーーーーーーーーーー");
// 腱鞘炎になる日数。
let Date = 0;
//　水が飲めた日。（もし１なら水が飲めた）
let waterDayNum;
let kenshouinNum;

while (true) {
  Date = Date + 1;

  waterDayNum = Math.floor(Math.random() * 3) + 1;

  // 水が飲めた場合(つまり、1を飲めた場合とする)
  if (waterDayNum == 1) {
    kenshouinNum = Math.floor(Math.random() * 30) + 1;
  } else {
    kenshouinNum = Math.floor(Math.random() * 10) + 1;
  }

  // 腱鞘炎になった場合(つまり、1を腱鞘炎になった場合とする)
  if (kenshouinNum == 1) {
    break;
  }
}

console.log("腱鞘炎になった日数は" + Date + "日です");

// ==========================================
// ### Page 50: practice 04 配列 (配列課題 ①)
// ①0から9までの連番の配列を作って、出力してみよう。
// ==========================================

// --------------------------------------------
//--50p 配列

// 配列を定義する
let array = [];

for (let j = 0; j < 10; j++) {
  array.push(j);
}

console.log("0から9までの連番の配列：" + array);

// ==========================================
// ### Page 50: practice 04 配列 (配列課題 ②)
// ② AさんとBさんが10回じゃんけんをする。
// ==========================================

//----------------------------------------------
// AさんとBさんが10回じゃんけんをする。
// 最後に何を出したかの10回分の履歴を表示する。

let aHand = [];
let bHand = [];
let hands = ["グー", "チョキ", "パー"];

// for (let k = 0; k < 10; k++) {
//   let a = Math.floor(Math.random() * 3);
//   let b = Math.floor(Math.random() * 3);
//   aHand[k] = hands[a];
//   bHand[k] = hands[b];

//   console.log("第" + (k + 1) + "回戦");
//   console.log("Aさんの手：" + aHand[k]);
//   console.log("Bさんの手：" + bHand[k]);
// }

// 課題番号51P_6
console.log("ーーーーーーーーーーーーーーーーー【50p 2】ジャンケン１０回の履歴出力 " + "\n" + "ーーーーーーーーーーーーーーーーー-");

let y = 0;
let handsA = [];
let handsB = [];

while (y < 10) {
  let a = Math.floor(Math.random() * 3);
  let b = Math.floor(Math.random() * 3);
  handsA.push(hands[a]);
  handsB.push(hands[b]);

  console.log("第" + (y + 1) + "回戦");
  console.log("Aさんの手：" + handsA[y]);
  console.log("Bさんの手：" + handsB[y]);

  y = y + 1;
}

// 最後に何を出したかの10回分の履歴を表示する。
console.log("Aさんの手：" + handsA);
console.log("Bさんの手：" + handsB);

// ==========================================
// ### Page 50: practice 04 配列 (配列課題 ③)
// ③0から99までのランダムな数値を10個生成して出力。
// ==========================================

console.log("ーーーーーーーーーーーーーーーーー【50p 3】ジャンケン１０回の履歴出力 " + "\n" + "ーーーーーーーーーーーーーーーーー-");

//----------------------------------------------
// ランダムな0から99までの数値を出力する。
// ランダムな数字を表示する。出力例8, 9, 10, 11, 12
// その通知の合計を表示する。293

let sumRandomNumber = 0;
let arrayRandomNumber = [];

for (let n = 1; n <= 10; n++) {
  // 0から99までのランダムな数値を出力
  let randomNumber = Math.floor(Math.random() * 100);

  arrayRandomNumber.push(randomNumber);
  sumRandomNumber *= randomNumber;
}

console.log("ランダムな数値：" + arrayRandomNumber);
console.log("1から10までのランダムな数値の合計は" + sumRandomNumber + "です");

//----------------------------------------------
// ==========================================
// ### Page 501 practice 04 配列 (配列課題 ③)
// 0から9までのランダムな数値を10個生成して出力。
// ただし、重複してはだめ。
// 出力例）0 5 3 7 2 9 8 6 1 4
// ==========================================

console.log("ーーーーーーーーーーーーーーーーーーーーーーーー【50p 4】ジャンケン１０回の履歴出力");

let uniqueRandomNumbers = [];

// for分ではない理由。　重複していて場合、繰り返しが１０回でするが、結果の数がたりない場合がある。
while (uniqueRandomNumbers.length < 10) {
  let randomNum = Math.floor(Math.random() * 10);
  // 重複していない場合のみ配列に追加
  if (!uniqueRandomNumbers.includes(randomNum)) {
    uniqueRandomNumbers.push(randomNum);
    console.log("いま配列にある数字は：" + uniqueRandomNumbers);
  } else {
    console.log("そのため、重複した数字：" + randomNum + "はスキップします");
  }
}

console.log("重複しないランダムな数値：" + uniqueRandomNumbers);

console.log("ーーーーーーーーーーーーーーーーーーーーーーーー【50p 4 別解】ジャンケン１０回の履歴出力");

// 　重複していない配列のはこ
let numbers = [];

// for分ではない理由。　重複していて場合、繰り返しが１０回でするが、結果の数がたりない場合がある。
while (numbers.length < 10) {
  let randomNum = Math.floor(Math.random() * 10);
  let sameFlg = false;

  // ループを使って、重複しているか確認　重複していたらFLGをたてる
  for (let m = 0; m < numbers.length; m++) {
    if (numbers[m] === randomNum) {
      sameFlg = true;
      console.log("そのため、重複した数字：" + randomNum + "はスキップします");
      break;
    }
  }

  // 重複していない場合のみ配列に追加 ここがtrueの場合は重複しているので追加しない
  if (!sameFlg) {
    numbers.push(randomNum);
    console.log("いま配列にある数字は：" + numbers);
  }
}

console.log("重複しないランダムな数値：" + numbers);

//----------------------------------------------
// ==========================================
// ### Page 51 practice 04 配列 (配列課題 ３)
// ➃の課題で出力した10個のランダムな数値を、昇順に並び替えてみよう３
// 出力例）0 5 3 7 2 9 8 6 1 4
// 0 1 2 3 4 5 ３ 7 8 9
// ==========================================
console.log("ーーーーーーーーーーーーーーーーーーーーーーーー【50p 5 別解】ジャンケン１０回の履歴出力");

// 昇順に並び替え（while loopを使用して）
let sortedNumbers = [];
while (uniqueRandomNumbers.length > 0) {
  // 最小値を見つける
  let min = Math.min(...uniqueRandomNumbers);
  // 最小値を新しい配列に追加
  sortedNumbers.push(min);
  // 元の配列から最小値を削除
  uniqueRandomNumbers.splice(uniqueRandomNumbers.indexOf(min), 1);
}
console.log("昇順に並び替えたランダムな数値：" + sortedNumbers);

console.log("ーーーーーーーーーーーーーーーーーーーーーーーー【50p 5 別解】４番で出力したランダムな数値を昇順にする");

// 重複していない配列のはこ
console.log(numbers);

//----------------------------------------------
// ==========================================
// 5の課題で出力した10個のランダムな数値を、降順に並び替えてみよう。
// 出力例）0 5 3 7 2 9 8 6 1 4
// 0 1 2 3 4 5 6 7 8 9
// ==========================================

// 課題番号51P_6
console.log("ーーーーーーーーーーーーーーーーー上記で出力した昇順の配列を降順にする_51P_6 " + "\n" + "ーーーーーーーーーーーーーーーーー-");

// 降順に並び替え（while loopを使用して）
// sortedNumbersを再利用（昇順の配列）

// 降順にする予定の配列
let descendingNumbers = [];

while (sortedNumbers.length > 0) {
  tempMax = Math.max(...sortedNumbers);
  descendingNumbers.push(tempMax);

  sortedNumbers.splice(sortedNumbers.indexOf(tempMax), 1);
}

console.log("降順にならびかえたランダムな配列は" + descendingNumbers);
//----------------------------------------------

// 課題番号51P5t（別解）
console.log("ーーーーーーーーーーーーーーーーー【51P_5別解】上記で出力した昇順の配列を降順にする_51P_6 " + "\n" + "ーーーーーーーーーーーーーーーーー-");

// ５つの配列だとすると　５回ループする
//
for (let i = 0; i < numbers.length - 1; i++) {
  for (let j = 0; j < numbers.length - 1 - i; j++) {
    // もし左の数値と右の数値が左の数値が大きい場合、入れ替えを行う
    if (numbers[j] > numbers[j + 1]) {
      let saveBox = numbers[j];
      // 入れ替え。大きいデータを右に移動
      numbers[j] = numbers[j + 1];
      numbers[j + 1] = saveBox;
    }
  }
}

// 課題番号51P_6（別解）
console.log("ーーーーーーーーーーーーーーーーー【51P_6別解】上記で出力した昇順の配列を降順にする_51P_6 " + "\n" + "ーーーーーーーーーーーーーーーーー-");

// ５つの配列だとすると　５回ループする
//
for (let i = 0; i < numbers.length - 1; i++) {
  for (let j = 0; j < numbers.length - 1 - i; j++) {
    // もし左の数値と右の数値が左の数値が大きい場合、入れ替えを行う
    if (numbers[j] < numbers[j + 1]) {
      let saveBox = numbers[j];
      // 入れ替え。大きいデータを右に移動
      numbers[j] = numbers[j + 1];
      numbers[j + 1] = saveBox;
    }
  }
}

console.log("降順にならびかえたランダムな配列は" + numbers);

// 降順に並び替え（while loopを使用して）
// sortedNumbersを再利用（昇順の配列）

// 降順にする予定の配列
// let descendingNumbers = [];

// while (sortedNumbers.length > 0) {
//   tempMax = Math.max(...sortedNumbers);
//   descendingNumbers.push(tempMax);

//   sortedNumbers.splice(sortedNumbers.indexOf(tempMax), 1);
// }

// console.log("降順にならびかえたランダムな配列は" + descendingNumbers);
// //----------------------------------------------

// 課題番号51P_6
console.log("ーーーーーーーーーーーーーーーーーさんづけで返す_58P_1 " + "\n" + "ーーーーーーーーーーーーーーーーー-");

// 名前を渡すとさんを付けて返す関数
function addSan(age, name) {
  return age + "才の" + name + "さん！おはようございます。";
}

console.log(addSan(40, "田中"));

function mixer(fruit1) {
  return fruit1 + "🥤";
}
console.log(mixer("りんご"));

// 課題番号51P_6
console.log("★★★ーーーーーーーーーーーーーーーーー配列を引数にしたらで合計値を返す_58P_2 " + "\n" + "ーーーーーーーーーーーーーーーーー-");

// 課題番号58P_1
console.log("◎◎ーーーーーーーーーーーーーーーーー配列を引数にしたらで合計値を返す_58P_2 " + "\n" + "ーーーーーーーーーーーーーーーーー-");

function mixer(name) {
  return name + "さん";
}
console.log(mixer("高橋"));

let isEven = function mixer1(name) {
  return name + "さん";
};
console.log(isEven("高橋"));

// 課題番号58P_1
console.log("😂ーーーーーーーーーーーーーーーーー配列を引数にしたらで合計値を返す_58P_2 " + "\n" + "ーーーーーーーーーーーーーーーーー-");

// function sumArray(calcNumbers) {
//   let total = 0;

//   for (let SumNum = 0; SumNum < calcNumbers.length; SumNum++) {
//     total += calcNumbers[SumNum];
//   }
//   return total;
// }

// console.log("配列の合計は" + sumArray([1, 2, 3, 4, 5, 15]));

function sumArray(calcNumbers) {
  let total = 0;
  for (let i = 0; i < calcNumbers.length; i++) {
    total += calcNumbers[i];
  }
  return total;
}

console.log(sumArray([1, 2, 3, 4, 5, 15]));

console.log("aaaa");
function aaa(bbb) {
  let totala = 0;
  for (let i = 0; i < bbb.length; i++) {
    totala += bbb[i];
  }
  return totala;
}

console.log(aaa([1, 2, 3, 4, 5, 15]) + "です");
// 課題番号58P_3
console.log("★BMI★ーーーーーーーーーーーーーーー", "\n" + "身長と体重を渡すとBMIを返す_58P_3 ");

// heightは身長、
// weightはkgは体重

// function calculateBMI(height, weight) {
//   // 身長をCMからMに変換
//   let heightM = height * 0.01;
//   let BMI = weight / (heightM * heightM);
//   return BMI;
// }

function calculateBMI(height, weight) {
  let bmi;
  bmi = weight / (height * 0.01 * (height * 0.01));
  return bmi.toFixed(2);
}

//BMIを計算して表示
console.log("BMIは" + calculateBMI(157, 52));

// 課題番号51P_5-------------------------------------------------------
console.log("★★昇順★★ーーーーーーーーーーーーーーーーー【51-５別解】数値と配列を渡すと、昇順でソートして配列を返す " + "\n" + "ーーーーーーーーーーーーーーーーー-");

// function sortArrayAsc(arr) {
//   for (let i = 0; i < arr.length - 1; i++) {
//     for (let j = 0; j < arr.length - 1 - i; j++) {
//       // もし左の数値と右の数値が左の数値が大きい場合、入れ替えを行う
//       if (arr[j] > arr[j + 1]) {
//         let saveBox = arr[j];
//         // 入れ替え。大きいデータを右に移動
//         arr[j] = arr[j + 1];
//         arr[j + 1] = saveBox;
//       }
//     }
//   }
//   return arr;
// }

console.log("◎◎◎昇順◎◎◎ーーーーーーーーーーーーーーーーー【51-５別解】数値と配列を渡すと、昇順でソートして配列を返す " + "\n" + "ーーーーーーーーーーーーーーーーー-");
function sortArrayAsc(arr) {
  for (let i = 0; i < arr.length - 1; i++) {
    for (let j = 0; j < arr.length - 1 - i; j++) {
      // もし左の数値と右の数値が左の数値が大きい場合、入れ替えを行う
      if (arr[j] > arr[j + 1]) {
        let saveBox = arr[j];
        // 入れ替え。大きいデータを右に移動
        arr[j] = arr[j + 1];
        arr[j + 1] = saveBox;
      }
    }
  }
  return arr;
}

console.log("配列昇順結果：" + sortArrayAsc([9, 5, 3, 2, 1]));

// 課題番号51P_５-------------------------------------------------------
console.log("ーーーーーーーーーーーーーーーーー【51-５別解】数値と配列を渡すと、昇順でソートして配列を返す " + "\n" + "ーーーーーーーーーーーーーーーーー-");

// 課題番号51P_5-------------------------------------------------------
console.log("ーーーーーーーーーーーーーーーーー語尾に「にゃん」をつける " + "\n" + "ーーーーーーーーーーーーーーーーー-");
// // 配列の各要素に「にゃん」をつけて新しい配列を返す関数
// function addNyanToArray(names) {
//   // 文字のなかに「。」あったら、そこに「にゃん」をつける
//   let modifiedWord = names.replace(/。/g, "にゃん。");
//   return modifiedWord;
// }

// let words = "こんにちは。お元気ですか。さようなら";
// console.log("語尾ににゃんをつけた配列：" + addNyanToArray(words));

function addNyanToArray(names) {
  let nyanname;
  // 文字のなかに「。」あったら、そこに「にゃん」をつける
  //  nyanname = names.replace(/。/g, "にゃん!");
  nyanname = names.replaceAll("。", "にゃん!");
  return nyanname;
}

// ---------------------------------
console.log(addNyanToArray("aaaa。おはようございます。さようなら。"));

function pushBtn() {
  const btnWord = document.getElementById("exam");
  btnWord.textContent = "おされました";
}

const eventBtn = document.getElementById("examEvent");
eventBtn.addEventListener(
  "click",
  function () {
    eventBtn.textContent = "イベント登録されました";
  },
  false,
);

// ボタンがあされた時と、inputTextの値をアラートで表示する
const showTextBtn = document.getElementById("showTextBtn");
showTextBtn.addEventListener("click", function () {
  const inputText = document.getElementById("inputText").value;
  sum = inputText + 10; // 入力された値に10をかける
  alert("入力された値に10をかけた結果は：" + sum);
});

// 課題番号65P_1 -------------------------------------------------------
console.log("ーーーーーーーーーーーーーーーーーボタンを押すと背景の色が赤に変わる。もう一つのボタンを押すと背景が青に変わる。" + "\n" + "ーーーーーーーーーーーーーーーーー-");

const colorChangeBtn = document.getElementById("colorChangeBtn");
colorChangeBtn.addEventListener("click", function () {
  const box = document.querySelector(".box");
  box.style.backgroundColor = "red";
});

// 課題番号65P_2 -------------------------------------------------------
console.log("ーーーーーーーーーーーーーーーーーボタンを押すと入力したカラーコードに色が変わる。" + "\n" + "ーーーーーーーーーーーーーーーーー-");

const colorChangeBtn2 = document.getElementById("applyColorBtn");
colorChangeBtn2.addEventListener("click", function () {
  const box = document.querySelector(".box");
  const colorInput = document.getElementById("colorInput").value;
  box.style.backgroundColor = colorInput;
});

// バブルソート復習 -------------------------------------------------------
console.log(
  "✕✕✕ーーーーーーーーーーーーーーーーー" +
    "\n" +
    "２回目完了``" +
    "ーーーーーーーーーーーーーーーーー-",
);
namesa = [5, 2, 8, 1];

// ようするに３回やって意味だえ。
for (let q = 0; q < namesa.length - 1; q++) {
  // まず➡に一番大きいものを移動する。
  for (let i = 0; i < namesa.length - 1; i++) {
    // もし1番目の数値が大きい場合
    if (namesa[i] > namesa[i + 1]) {
      let saveBox = namesa[i];
      // 入れ替え。大きいデータを右に移動
      namesa[i] = namesa[i + 1];
      namesa[i + 1] = saveBox;
    }
  }
}

console.log("昇順にならびかえたランダムな配列は" + namesa);
